"""
Побудувати масив А=(ai), елементи якого задаються формулою:
ai=(-1+2-3+...+((-1)**i)*i)/i!
знайти суму додатніх значень A 
"""
#0 Позначення
"""
Довжина масиву - int - n
Масив – list[float] a 
Чисельник (Сума послідовності -1+2...) - float - s
Знаменник (інтеграл i!) - int - k
Сума додатніх - float - sum
"""
n = int(input("Введіть довжину масиву : "))
a = []
k = 1
s = sum = 0
for i in range(1,n+1) :
    k = k*i
    s = s+((-1)**i)*i
    a.append(s/k)
    if a[i-1] > 0 :
        sum = sum + a[i-1]
print(sum)

"""
- input - - - - - 
        Введіть довжину масиву : 5
- output - - - - -
        0.5833333333333334
"""
