"""
Дано два вектори. x,y є R**n
Знайти скалярний добуток векторів.
"""
#0 Позначення
"""
Вектор x  - list[float] - x
Вектор y  - list[float] - y
Кількість вимірів - int - n
Скалярний добутор - float - sum
"""
n=int(input("Введіть кількість вимірів : "))
x=[]
y=[]
sum = 0
for i in range(n) :
    x.append(float(input("Введіть значення {0} виміру для вектора x : ".format(i+1))))
    y.append(float(input("Введіть значення {0} виміру для вектора y : ".format(i+1))))
    sum = sum + x[i] * y[i]
print(f"Скалярний добуток векторів дорівнює : {sum}")
"""
- input - - - - - 
        Введіть кількість вимірів : 2
        Введіть значення 1 виміру для вектора x : 5
        Введіть значення 1 виміру для вектора y : 7
        Введіть значення 2 виміру для вектора x : 2
        Введіть значення 2 виміру для вектора y : 5
- output - - - - -
        Скалярний добуток векторів дорівнює : 45.0
"""
