"""
Впорядкувати елементи масиву таким чином,
щоб спочатку були розміщені всі додатні елементи,
а потім всі від’ємні(0 вважаємо додатнім елементом).
"""
#0 Позначення
"""
Основний масив – list[float] - n
Впорядкований масив масив – list[float] - m
Координати елементів масиву - int - k,h
Змінна для перебору елементів масиву - int - i
"""
n = []
m = []
i = k = 0
h = -1
while True :
    n.append((input("Введіть значення числа : ".format(i))))
    if n[i] == "" :
        break
    i+=1
n.pop(-1)
for i in range(0, len(n)) :
    if float(n[i]) >= 0 :
        m.insert(k,n[i]) 
    else :
        m.insert(h,n[i])
if float(m[-1]) >= 0 :
    m.insert(0 , m[-1])
    m.pop(-1) 
print(list(m))


"""
- input - - - - - 
        Введіть значення числа : 0
        Введіть значення числа : -0.2
        Введіть значення числа : 1
        Введіть значення числа : 2
        Введіть значення числа :
- output - - - - -
        ['0', '2', '1', '-0.2']
"""

