"""
Дано дійсне число a
і натуральне n
обчислити a**2(a+1)**2...(a+n-11*2
"""
#0 Позначення
"""
Дійсне число - float - a
Натуральне число - int - n
Змінна на яке ми завжди множимо - float - sum
Результат - float - result
"""
a = float(input("Введіть значення дійсного числа а : "))
n = int(input("Введіть значення натурального числа n : "))
result = 1
for i in range(n) :
    sum = (a+i)**2
    result *= sum
print(sum)

"""
- input - - - - - 
        Введіть значення дійсного числа а : 2
        Введіть значення натурального числа n : 2

- output - - - - -
        9.0
"""
