import math
"""
Трикутник задається координатами своїх вершин на площині: 
A(x1,y1)    B(x2,y2)    C(x3,y3)
Визначити, чи є цей трикутник гострокутним.
"""
# 0.Позначення
"""
Координати x1,x2,x3,y1,y2,y3 - float - x1,x2,x3,y1,y2,y3
Модулі векторів - float - ab,bc,ac
"""
x=[]
y=[]
for i in range(3) :
    x.append(float(input("Введіть здачення x{0} : ".format(i+1))))
    y.append(float(input("Введіть здачення y{0} : ".format(i+1))))
ab=(math.sqrt(((x[0] - x[1])**2) + ((y[0] - y[1])**2)))
ac=(math.sqrt(((x[0] - x[2])**2) + ((y[0] - y[2])**2)))
bc=(math.sqrt(((x[1] - x[2])**2) + ((y[1] - y[2])**2)))
if ab**2<(bc**2)+(ac**2) and ac**2<(bc**2)+(ab**2) and bc**2<(ac**2)+(ab**2):
    print("Трикутник гострокутний")
else:
    print("Трикутник негострокутний")
"""
- input - - - - - 
                    x1 = 1
                    y1 = 1
                    x2 = 2
                    y2 = 2
                    x3 = 3
                    y3 = 1
- output - - - - -
                    Трикутник гострокутний
"""
